placeholder/dbl_0_58_128_8/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
6502
(
1.4875
1.4875
1.4875
1.4875
1.4875
1.4875
1.4875
1.4875
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5);
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
446
(
1.4875
1.4625
1.4375
1.4125
1.3875
1.3625
1.3375
1.3125
...
)
;
    }
    baffle
    {
        type            calculated;
        value           nonuniform List<scalar> 
98
(
0.987391
0.962174
0.936957
0.911739
0.886522
0.861304
0.836087
0.81087
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
